# Tap for Nerd Fonts and other font casks
tap "homebrew/cask-fonts"

# ----------------------------------------
# FORMULAE (COMMAND-LINE TOOLS) 🛠️
# ----------------------------------------

# Shell & Navigation
brew "zsh"
brew "eza"        # Modern replacement for 'ls'
brew "zoxide"     # Smarter 'cd' command
brew "fzf"        # Command-line fuzzy finder
brew "trash-cli"  # Move files to trash instead of 'rm'

# Development Tools
brew "asdf"       # Version manager for multiple runtimes
brew "go"
brew "stow"       # Symlink farm manager
brew "direnv"     # Load/unload environment variables depending on dir
brew "lazygit"    # Terminal UI for Git

# Cloud & K8s
brew "awscli"
brew "k9s"        # Terminal UI for Kubernetes
brew "kubectx"    # Switch between kubectl contexts

# Utilities & Enhancements
brew "bat"        # A 'cat' clone with syntax highlighting
brew "htop"       # Interactive process viewer
brew "jq"         # Command-line JSON processor
brew "ripgrep"    # Fast, recursive search tool
brew "starship"   # Cross-shell prompt
brew "atuin"      # Magical shell history

# Neovim
brew "neovim"

# File Management
brew "yazi"       # Terminal file manager

# Zsh Plugins
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"

# ----------------------------------------
# CASKS (FONTS & APPS) 💻
# ----------------------------------------
cask "wezterm"        # Terminal emulator 
cask "rancher"        # Kubernetes and Docker GUI
cask "1password"      # Password manager 
cask "1password-cli"  # Password manager CLI 

# Nerd Fonts are great for developer tool icons in the terminal
cask "font-symbols-only-nerd-font"
